di=[0,1,1,1,0,-1,-1,-1]
dj=[1,1,0,-1,-1,-1,0,1]
m=['.','@']
n=10
next=[[0]*(n+2) for i in range(n+2)]
now=[[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]]

for cycle in range(3):
    for i in range(1,n+1):
        for j in range(1,n+1): 
            print(m[now[i][j]],end=' ')
        print()
    for i in range(1,n+1):
        for j in range(1,n+1):
            s=0
            for k in range(8):
                s+=now[i+di[k]][j+dj[k]]
            next[i][j]=(now[i][j]==0 and s==3) or (now[i][j]==1 and (s==2 or s==3))
    #for i in range(n+2):
        #for j in range(n+2):
            #now[i][j]=next[i][j]
    print('\n')
                #next[i][j]=1
            #else: next[i][j]=0
            #print(m[next[i][j]],end=' ')
        #print()
#임세원바보바보바보바보바보바보바보바보
#멍청이멍청이멍청이멍청이멍청이멍청이
#메롱메롱메롱메롱메롱메롱메롱메롱메롱
#군대 한번더ㅓ?
#잘가아아아ㅏㅏ~~~~ 히히ㅣ키히ㅣ킼힠힠ㅎ힠히키히키
"""☆★☆★ 군대 재입대 기원 ☆★☆★"""